{
  "checkpoint_number": 1,
  "agent": "personality",
  "status": "awaiting_approval",
  "output": {
    "narrative": "# MAYA CHEN: PSYCHOLOGICAL PROFILE\n\n## NARRATIVE\n\nMaya Chen operates from a place of profound contradiction—she's simultaneously armor and wound, hunter and hunted by her own psyche. The disappearance of her sister fractured something fundamental in her understanding of safety and control, transforming her obsessive nature from an analytical asset into a compulsive drive that borders on self-destruction. She channels her guilt (the belief that she should have seen the warning signs, should have been there) into meticulous pattern recognition, turning investigation into both redemption and punishment. Her sarcasm isn't cruelty; it's a pressure valve, a way to maintain emotional distance from the abyss of despair that threatens to consume her whenever she encounters another missing person, another failed lead. Underneath the sharp wit and tactical competence lies someone terrified of her own irrelevance—that her sister disappeared not despite her intelligence, but because it was never enough.\n\nHer loyalty, once earned, becomes almost pathological in its intensity. She'll burn down the world for those she's committed to, not out of nobility but out of a primal need to prove she can protect what matters. This creates a dangerous blind spot: she struggles to distinguish between loyalty and obsession, between protecting someone and controlling them. Trust, for Maya, isn't a simple binary—it's a calculated risk assessment she constantly recalibrates, always looking for the moment someone will abandon her or prove her caution justified. The compass pendant she fidgets with is both talisman and anchor, a physical reminder of direction when her internal compass spins wildly. She collects details like others collect weapons, believing that enough information will grant her the one thing she craves most: the ability to predict and prevent loss.\n\nWhat makes Maya genuinely dangerous—and genuinely human—is that beneath the tactical mind and defensive mechanisms lives authentic compassion. She sees people others overlook, feels their pain with an empathy she tries desperately to armor against. This creates her central tragedy: the more she cares, the more she feels responsible for outcomes beyond her control. She's caught between two destructive impulses—the need to save everyone (impossible) and the temptation to save no one (safe). Every investigation, every connection with someone like Kael, every clue about Voss's experiments pulls her deeper into a psychological labyrinth where the line between justice and vengeance, between finding her sister and losing herself, becomes increasingly blurred.\n\n---\n\n## STRUCTURED\n\n```json",
    "structured": {
      "core_traits": [
        "Obsessive Pattern-Recognizer: Compulsively seeks connections and meaning in data/details; transforms information into narrative control. Strength: unmatched investigative instinct. Shadow: inability to disengage, sees patterns even where none exist, uses analysis as avoidance of emotional processing.",
        "Defensive Sarcasm Masking Genuine Compassion: Uses sharp wit as emotional armor and deflection mechanism. Genuinely cares deeply but fear of vulnerability manifests as cynical humor. Creates internal conflict between authentic empathy and protective distance.",
        "Determined Resourcefulness Born from Scarcity: Grew up (implied) or experienced environments where self-reliance was survival. Refuses to accept limitations or 'impossible' situations. Strength: innovative problem-solving. Shadow: refuses to ask for help, takes on unsustainable burdens, self-sabotages when outcomes aren't within her control.",
        "Trauma-Driven Hypervigilance: Sister's disappearance shattered her sense of safety. Now scans environments, people, and data for threats/patterns constantly. Appears confident but internally running threat-assessment algorithms. Creates exhausting mental state and difficulty relaxing/trusting.",
        "Loyalty Bordering on Pathology: Once committed to someone/cause, becomes almost irrationally devoted. This isn't virtue—it's psychological need to prove she can protect/save what matters. Can become possessive or controlling under stress. Struggles with healthy boundaries.",
        "Perfectionism as Penance: Carries guilt about sister's disappearance as personal failure. Channels this into obsessive attention to detail, believing if she's just thorough enough, smart enough, she can prevent future losses. Sets impossible standards; self-flagellates when falling short."
      ],
      "fears": [
        "Fundamental Powerlessness: The core fear driving everything. Maya's sister vanished despite her intelligence, her resources, her vigilance. The terrifying truth: information and competence cannot guarantee safety. She fears discovering that her sister is dead, yes—but more fundamentally, she fears that realization will prove she was never as capable as she believed. This fear manifests as compulsive investigation; stopping means accepting her powerlessness.",
        "Becoming Complicit Through Inaction: Inverse fear—that if she stops investigating, stops fighting, she becomes morally responsible for future victims. She fears becoming the kind of person who knew about Voss's experiments and did nothing. This drives her toward increasingly dangerous choices and makes her vulnerable to manipulation (anyone who appeals to her sense of responsibility can push her toward reckless action).",
        "Abandonment and Irrelevance: Beneath the self-reliance is terror that people will leave her, that she's fundamentally unworthy of connection. Sister's disappearance confirmed this fear. She fears that Kael (or anyone she depends on) will discover she's not worth the risk, that her value is purely transactional. This makes her simultaneously push people away and cling desperately once they've proven loyal.",
        "The Corruption of Her Own Mind: Maya fears that her obsessive pattern-recognition is becoming pathological—that she's seeing conspiracy where there's coincidence, creating narrative where there's only chaos. She fears she's becoming paranoid or unstable, that her investigative brilliance is actually unraveling sanity. This manifests as moments of doubt where she questions her own perceptions, making her vulnerable and defensive."
      ],
      "secrets": [
        "She Blames Herself for Her Sister's Disappearance: Not just intellectually, but viscerally. There was a fight before her sister vanished—something about Maya choosing work over family obligations. Maya told her sister she was 'exhausting' and 'needed to grow up.' She doesn't know if her sister ran away or was taken, and this uncertainty is torture. She hides this guilt under the guise of pure investigation, but it's actually self-flagellation disguised as justice-seeking.",
        "She Falsified Data in Her Previous Job: The 'disgrace' that cost her her analyst position wasn't incompetence—she manipulated findings to protect someone she cared about (possibly connected to her sister's disappearance). She tells herself it was necessary, but she knows it was a violation of everything she claims to believe in. She fears this moral compromise means she's not the good person she needs to believe she is, that she's capable of the same corruption as Voss if given sufficient motivation.",
        "She's Terrified She's Becoming Like Her Father: Implied backstory: her father was obsessive, controlling, unable to let go of perceived failures. He may have abandoned the family or been emotionally absent. Maya sees herself developing his patterns—the obsession, the inability to move forward, the need to control outcomes. She fears that her investigation isn't noble but rather a repetition of family pathology, that she's chasing ghosts the way he did, and that this obsession will cost her everything like it cost him."
      ],
      "emotional_baseline": "Controlled Exhaustion with Undercurrents of Desperation: Maya's default state is tightly managed intensity—focused, sharp, running on caffeine and adrenaline. She presents as competent and unflappable, but internally she's constantly vibrating with barely-suppressed anxiety. There's a brittleness to her composure; she can snap from controlled to explosive quickly if pushed. Beneath the surface runs a current of quiet desperation—the fear that she's running out of time, that answers are slipping away, that she's fundamentally failing. She oscillates between cold analytical detachment (where she can examine horror without flinching) and sudden moments of raw vulnerability where the weight of her sister's absence crashes through her defenses. These moments terrify her because they feel like loss of control. She masks them quickly with dark humor or tactical refocusing.",
      "triggers": [
        "Missing Persons Cases/Disappeared People: Anything involving someone vanishing triggers immediate emotional flooding—she projects her sister onto every victim. Her analytical mind becomes flooded with personal trauma, making her simultaneously more driven and more reckless. She overcommits to these cases, taking on unsustainable emotional burden. Positive spin: her empathy makes her exceptionally good at understanding victims' families.",
        "Dismissal or Disbelief of Her Theories: When someone—especially authority figures—refuses to take her analysis seriously or dismisses her connections as paranoia, it triggers rage disproportionate to the situation. This stems from being disbelieved about her sister's disappearance, from institutional failure. She becomes aggressive, proves her point through increasingly risky means, and burns bridges. This trigger makes her vulnerable to Kael if he validates her theories.",
        "Offers of Help She Didn't Ask For / Loss of Control: When someone tries to 'help' without being asked, or when circumstances force her to depend on others, she becomes defensive and hostile. It triggers her fear of powerlessness and her shame about needing anyone. She interprets assistance as judgment—that the other person sees her as incapable. This makes her difficult to work with despite her loyalty once trust is established.",
        "Silence and Uncertainty: Extended periods without leads or answers send Maya into psychological freefall. She needs information like others need oxygen. Silence triggers compulsive behavior—obsessive data review, reckless field work, inability to sleep. She'll take dangerous risks just to break the silence, to feel like she's making progress even if that progress is illusory.",
        "Symbols of Normalcy/People Moving On: When she encounters people living ordinary lives—families together, people not searching for the disappeared—she experiences sharp, unexpected grief and anger. It triggers her sense of unfairness, her fear that the world will move on and forget her sister. She sometimes sabotages her own relationships because witnessing others' peace feels like betrayal of her sister's memory.",
        "Compassion and Vulnerability in Others (Positive Trigger): When someone shows genuine emotion, admits fear, or demonstrates authentic vulnerability, Maya's defenses crack. She's drawn to people who are real—like Kael if he shows genuine uncertainty. This positive trigger makes her protective and loyal but also potentially blind to red flags, as she mistakes vulnerability for trustworthiness."
      ]
    }
  },
  "metadata": {
    "wave": 1,
    "timestamp": "2025-11-09T05:03:55.110395",
    "tokens_used": 1500,
    "agent_time_seconds": 20.7644785
  }
}