{
  "checkpoint_number": 4,
  "agent": "physical_description",
  "status": "awaiting_approval",
  "output": {
    "narrative": "# MAYA CHEN: PHYSICAL PRESENCE PROFILE\n\n## NARRATIVE\n\nMaya Chen moves through the world like someone perpetually mid-calculation, her body a physical manifestation of her fractured attention. There's a coiled tension beneath her lean frame—not the relaxed readiness of a trained fighter, but something more exhausting: the constant hum of threat-assessment running in the background of every interaction. She enters rooms with her eyes already cataloging: exits, sight lines, potential weapons, the micro-expressions of people she doesn't trust (which is everyone, initially). Her spine maintains an almost military straightness, a posture learned young—whether from perfectionist pressure or something else, it's unclear—but it's undercut by the way her shoulders curve inward slightly, as if she's simultaneously trying to make herself smaller and more imposing. It's a contradiction that defines her: she wants to be invisible but commands attention anyway.\n\nHer movements carry the efficiency of someone who learned early that wasted motion is wasted resources. She doesn't gesture expansively when speaking; instead, her hands stay close to her body, fingers often occupied with the silver compass pendant at her throat—turning it, running her thumb along its edge, opening and closing the mechanism obsessively. This fidgeting isn't nervous energy seeking release; it's a self-soothing ritual, a tangible anchor point when her mind spirals into pattern-recognition overdrive. When she walks, there's a controlled quality to her stride—not rushed, but purposeful, with the economical grace of someone who's learned to move through hostile spaces. She walks quietly, her footfalls deliberate, and she has an unsettling habit of appearing in doorways without announcement, as if she's calibrated her movement to minimize the auditory signature that might alert others to her presence.\n\nThe most striking aspect of Maya's physical presence is her stillness. In conversation, especially with people she doesn't fully trust, she can become almost motionless—a predatory immobility that's more unsettling than fidgeting. Her face remains controlled, but her eyes are always moving, tracking, analyzing. Only when she's deeply engaged with data or with someone who's proven themselves trustworthy (rare) does she relax incrementally, her shoulders dropping slightly, her hands stilling. Even then, there's a brittleness to it, a sense that she's one piece of bad news away from snapping back into threat-assessment mode. Her scar—that thin line along her left cheekbone—seems to deepen when she's stressed, as if the tension pulls her skin taut. She rarely touches her scar consciously, but people notice her awareness of it; she'll angle her head away from it in conversation, a gesture that reads as both self-consciousness and strategic positioning, keeping her right side (her \"good\" side) toward exits and potential threats.\n\n---\n\n## STRUCTURED\n\n```json",
    "structured": {
      "mannerisms": [
        "Obsessively manipulates her silver compass pendant—opening and closing the mechanism, running her thumb along its cardinal points, especially when processing information or under stress. The gesture is meditative but also ritualistic, a physical anchor that prevents her mind from untethering into pure pattern-recognition.",
        "Scans for exits upon entering any space—her eyes perform a rapid triangulation of doorways, windows, and potential escape routes before she fully engages with the environment. This happens automatically, below conscious awareness most of the time, but it's visible as a brief moment where her gaze 'maps' the room before settling.",
        "Tilts her head minutely when suspicious or encountering information that doesn't align with her patterns—a bird-like gesture that's almost imperceptible, but it signals her analytical mind is flagging an inconsistency. People who know her learn to recognize this as a sign she's caught something.",
        "Cracks her knuckles in a specific sequence (pinky to index on each hand) before confrontation or when about to voice a challenging theory—a ritualistic preparation that gives her a moment to steel herself and signals to observant people that she's about to push back.",
        "Positions her body at angles rather than directly facing people, especially authority figures or those she doesn't trust—a 45-degree orientation that allows her to maintain peripheral awareness of exits and other people in the space. It reads as casual but is actually strategic.",
        "Mirrors the breathing patterns of people she's trying to read or manipulate—unconsciously syncing her breath to theirs, a subtle empathetic response that contradicts her defensive exterior. This happens when she's genuinely engaged rather than in threat-assessment mode."
      ],
      "body_language": "Maya's default posture is paradoxical: her spine maintains rigid straightness (a holdover from perfectionist conditioning and the need to project competence), but her shoulders curve inward slightly, creating a subtle concave quality to her upper body. It's the posture of someone trying to be both immovable and unobtrusive simultaneously. Her arms typically remain close to her torso rather than open to the space around her—a closed posture that contradicts her intelligence and capability. Her hands are rarely still; when not fidgeting with her compass, her fingers move with restless precision: tapping patterns on surfaces, tracing the seams of her jacket, or forming shapes in the air as she thinks through problems. Her head is frequently tilted slightly downward, not in submission but in the posture of someone reviewing data on an internal screen. When she sits, she rarely settles fully into furniture; instead, she perches on the edge of chairs, her feet planted firmly on the ground, maintaining the physical readiness to move. Her face is typically composed into an expression of controlled neutrality—a professional mask that reveals nothing—but her eyes are in constant motion, tracking micro-expressions and environmental details. When stressed or triggered, her jaw tightens visibly, and she develops a habit of pressing her tongue against the roof of her mouth, creating a subtle tension across her face. In moments of genuine connection or when her defenses crack, her posture loosens almost imperceptibly; her shoulders drop, her head lifts, and she makes more direct eye contact, but this vulnerability is fleeting—she catches herself relaxing and re-tightens almost immediately, as if she's caught herself breaking protocol.",
      "movement_style": "Maya moves with controlled efficiency—no wasted motion, no flourishes. Her walk is quiet and measured, with a stride length that's slightly shorter than her height would suggest, giving her movement a contained quality. She doesn't stride; she glides, her footfalls deliberate and nearly silent, as if she's learned to move through the world without announcing her presence. Her pace varies with her mental state: when she's engaged in investigation or threat-assessment, she moves faster, with a subtle restlessness in her gait—her fingers twitch, her head swivels to track details, and she'll often stop abruptly when a thought strikes her. When she's processing difficult emotions or operating in stealth mode, she slows to an almost glacial pace, each movement economical and precise. Her gestures when speaking are minimal and close to her body—she doesn't use her hands expansively to illustrate points. Instead, her fingers make small, precise movements: pointing to specific details, forming shapes that represent data connections, or gripping her jacket when containing emotion. When she's animated or passionately explaining a theory, her hands rise slightly, her fingers spread in patterns that mirror network connections or data flows, but even then, the gestures remain within a relatively narrow radius around her torso. She has an unsettling habit of appearing in doorways or beside people without them noticing her approach—not through supernatural stealth, but through a combination of quiet movement and people's tendency to miss what they're not expecting to see. When confronted or threatened, her movement becomes even more controlled; she'll plant her feet in a grounded stance, her weight distributed evenly, her body angled to maintain peripheral awareness. There's a coiled quality to her stillness in these moments—not passive, but ready.",
      "physical_quirks": [
        "When deeply engaged in data analysis or problem-solving, Maya unconsciously traces patterns in the air with her index finger—drawing connections, mapping networks, writing equations—as if her hands are translating the data structures her mind is processing. She's often unaware she's doing this until someone points it out.",
        "She bites the inside of her cheek when processing information that contradicts her theories—a nervous habit that causes her to occasionally draw blood. It's a self-inflicted pain that seems to help her recalibrate her thinking, a physical way of forcing her mind to accept new data.",
        "Her left eye twitches slightly when she's lying or withholding information—a tell she's aware of but can't fully control. She compensates by keeping her left side angled away from people, or by touching her face near that eye as if scratching an itch, trying to mask the tell.",
        "She drums a specific rhythm on surfaces when impatient or waiting for information: three quick taps, a pause, two quick taps—a pattern that repeats. It's the rhythm of a data transmission pulse, unconsciously encoded into her physical nervous system.",
        "When someone shows genuine vulnerability or emotional authenticity around her, Maya's breathing becomes slightly shallow, and she'll unconsciously lean forward by mere inches—a physical response to her defenses cracking. She catches herself doing this and pulls back, creating a visible moment of self-correction that reads as rejection even when it's actually self-protection."
      ]
    }
  },
  "metadata": {
    "wave": 2,
    "timestamp": "2025-11-09T05:05:12.948931",
    "tokens_used": 1400,
    "agent_time_seconds": 15.090288000000001
  }
}