{
  "checkpoint_number": 6,
  "agent": "relationships",
  "status": "awaiting_approval",
  "output": {
    "narrative": "# MAYA CHEN: RELATIONSHIP DYNAMICS PROFILE\n\n## NARRATIVE\n\nMaya Chen's relational world is a carefully constructed fortress with hidden cracks. On the surface, she appears self-sufficient—someone who prefers solitude, who doesn't need anyone. But this is armor. Beneath it lies a woman terrified of abandonment, desperately seeking proof that she's worth staying for, that her value extends beyond what she can analyze or solve. Her relationships are few but intense, characterized by a push-pull dynamic: she simultaneously pushes people away with defensive sarcasm and clings to them with almost desperate loyalty once they've proven they won't leave.\n\nThe disappearance of her sister Iris fractured Maya's capacity for normal attachment. She experiences relationships through a lens of threat-assessment and utility evaluation—Who can help find Iris? Who might betray me? Can I trust this person enough to be vulnerable? This hypervigilance exhausts her and creates a self-fulfilling prophecy: people sense her distrust and withdraw, confirming her fear that she's fundamentally unworthy of connection. Her relationships are transactional in her mind, even when she desperately wants them to be genuine. She struggles to distinguish between people who genuinely care about her and people who are useful to her investigation—and this confusion will become a critical vulnerability when manipulative figures (like Kael, if he proves duplicitous) exploit her need for validation and partnership.\n\nMaya's loyalty, once earned, is pathological. She will sacrifice her own wellbeing, compromise her ethics, and make increasingly reckless choices for anyone who has proven themselves trustworthy. This is not strength; it's a trauma response—a compulsive need to prove she can protect and save what matters, to undo the failure of not saving Iris. Her relationships become pressure cookers where she unconsciously tests others' commitment, pushing boundaries to see if they'll abandon her like everyone else has. The people closest to her will experience her as simultaneously the most loyal ally and the most exhausting burden—someone who needs constant reassurance that she matters, whose obsessions become their obsessions, whose battles become inescapable.\n\n---\n\n## STRUCTURED\n\n```json",
    "structured": {
      "relationships": [
        {
          "character": "Unknown",
          "type": "unknown",
          "dynamic": "Unknown",
          "evolution": "Unknown"
        }
      ]
    }
  },
  "metadata": {
    "wave": 3,
    "timestamp": "2025-11-09T05:06:09.532895",
    "tokens_used": 1800,
    "agent_time_seconds": 52.679243
  }
}