{
  "character_id": "8cf65f1c-6474-4d3a-ac38-d708ea1064d6",
  "input_data": {
    "characters": [
      {
        "name": "Maya Chen",
        "appearance": "Early 30s, East Asian woman with shoulder-length black hair with subtle auburn highlights. Sharp, intelligent eyes with a scar running along her left cheekbone. She wears a worn leather jacket over tech-embedded clothing. Lean, athletic build with callused hands suggesting technical work. Has a small silver compass pendant she fidgets with.",
        "personality": "Determined, resourceful, carries emotional baggage from past failures. Sarcastic as a defense mechanism but genuinely compassionate. Obsessive about details and patterns. Struggles with trusting others but fiercely loyal once committed.",
        "role": "Protagonist - a disgraced data analyst turned underground investigator searching for her missing sister"
      },
      {
        "name": "Kael",
        "appearance": "Mid-40s, androgynous figure with silver-streaked dark hair worn in loose braids. Deep brown skin, warm amber eyes that seem to shift colors in light. Wears flowing, layered clothing in earth tones. Tall and graceful with deliberate, measured movements. Several geometric tattoos cover their forearms.",
        "personality": "Mysterious and cryptic, speaks in philosophical riddles. Patient mentor figure with hidden depths. Knows far more than they initially reveal. Calm under pressure but occasionally shows glimpses of hidden pain.",
        "role": "Guide/Ally - an enigmatic person Maya meets who claims to know about her sister's disappearance and offers cryptic guidance"
      },
      {
        "name": "Voss",
        "appearance": "Late 50s, sharp-featured man with slicked-back salt-and-pepper hair. Cold grey eyes and a perpetual slight smirk. Always impeccably dressed in expensive dark suits. Thin, angular face with a prominent jaw. A deep voice that carries quiet authority.",
        "personality": "Calculating and ruthless, operates in moral grey zones. Charming on the surface but genuinely menacing underneath. Views people as assets or obstacles. Driven by ambition and control rather than emotion.",
        "role": "Antagonist - powerful figure running a shadow organization connected to Maya's sister's disappearance"
      }
    ],
    "storyline": {
      "overview": "Maya Chen, a disgraced data analyst, stumbles upon a digital trail leading to her missing sister's disappearance. She's drawn into a dangerous world of shadow organizations and hidden truths, meeting the mysterious Kael who becomes her guide. Together they uncover a conspiracy involving the powerful industrialist Voss, who has been using disappeared people for unethical experiments. Maya must navigate betrayal, revelation, and impossible choices to find her sister and dismantle the organization—or burn it all down.",
      "tone": "Cyberpunk noir with elements of psychological thriller and light science fiction. Dark, atmospheric, tense with moments of quiet character reflection. Emotionally grounded despite sci-fi elements.",
      "scenes": [
        "Opening: Maya in her cramped apartment, late night, discovering an encrypted file with her sister's digital signature",
        "First investigation: Maya hacking into corporate databases, getting too close, barely escaping when alarms trigger",
        "Meeting Kael: In an abandoned subway station, Kael approaches Maya with knowledge she never shared publicly",
        "The revelation: Discovering video evidence of her sister alive in a facility, but changed, suggesting memory manipulation",
        "Infiltration: Maya and Kael break into a Voss facility to find the truth and locate her sister",
        "Confrontation: Face-to-face with Voss, who reveals he knew her sister intimately and offers Maya a choice",
        "The twist: Discovering her sister was willing—a volunteer in exchange for payment to help their dying mother",
        "Final decision: Maya must choose between revenge, justice, or saving what remains of her relationship with her sister",
        "Ending: Ambiguous conclusion where Maya walks away from the city with new purpose, changed but not broken"
      ]
    }
  },
  "mode": "balanced",
  "personality": {
    "core_traits": [
      "Obsessive Pattern-Recognizer: Compulsively seeks connections and meaning in data/details; transforms information into narrative control. Strength: unmatched investigative instinct. Shadow: inability to disengage, sees patterns even where none exist, uses analysis as avoidance of emotional processing.",
      "Defensive Sarcasm Masking Genuine Compassion: Uses sharp wit as emotional armor and deflection mechanism. Genuinely cares deeply but fear of vulnerability manifests as cynical humor. Creates internal conflict between authentic empathy and protective distance.",
      "Determined Resourcefulness Born from Scarcity: Grew up (implied) or experienced environments where self-reliance was survival. Refuses to accept limitations or 'impossible' situations. Strength: innovative problem-solving. Shadow: refuses to ask for help, takes on unsustainable burdens, self-sabotages when outcomes aren't within her control.",
      "Trauma-Driven Hypervigilance: Sister's disappearance shattered her sense of safety. Now scans environments, people, and data for threats/patterns constantly. Appears confident but internally running threat-assessment algorithms. Creates exhausting mental state and difficulty relaxing/trusting.",
      "Loyalty Bordering on Pathology: Once committed to someone/cause, becomes almost irrationally devoted. This isn't virtue—it's psychological need to prove she can protect/save what matters. Can become possessive or controlling under stress. Struggles with healthy boundaries.",
      "Perfectionism as Penance: Carries guilt about sister's disappearance as personal failure. Channels this into obsessive attention to detail, believing if she's just thorough enough, smart enough, she can prevent future losses. Sets impossible standards; self-flagellates when falling short."
    ],
    "fears": [
      "Fundamental Powerlessness: The core fear driving everything. Maya's sister vanished despite her intelligence, her resources, her vigilance. The terrifying truth: information and competence cannot guarantee safety. She fears discovering that her sister is dead, yes—but more fundamentally, she fears that realization will prove she was never as capable as she believed. This fear manifests as compulsive investigation; stopping means accepting her powerlessness.",
      "Becoming Complicit Through Inaction: Inverse fear—that if she stops investigating, stops fighting, she becomes morally responsible for future victims. She fears becoming the kind of person who knew about Voss's experiments and did nothing. This drives her toward increasingly dangerous choices and makes her vulnerable to manipulation (anyone who appeals to her sense of responsibility can push her toward reckless action).",
      "Abandonment and Irrelevance: Beneath the self-reliance is terror that people will leave her, that she's fundamentally unworthy of connection. Sister's disappearance confirmed this fear. She fears that Kael (or anyone she depends on) will discover she's not worth the risk, that her value is purely transactional. This makes her simultaneously push people away and cling desperately once they've proven loyal.",
      "The Corruption of Her Own Mind: Maya fears that her obsessive pattern-recognition is becoming pathological—that she's seeing conspiracy where there's coincidence, creating narrative where there's only chaos. She fears she's becoming paranoid or unstable, that her investigative brilliance is actually unraveling sanity. This manifests as moments of doubt where she questions her own perceptions, making her vulnerable and defensive."
    ],
    "secrets": [
      "She Blames Herself for Her Sister's Disappearance: Not just intellectually, but viscerally. There was a fight before her sister vanished—something about Maya choosing work over family obligations. Maya told her sister she was 'exhausting' and 'needed to grow up.' She doesn't know if her sister ran away or was taken, and this uncertainty is torture. She hides this guilt under the guise of pure investigation, but it's actually self-flagellation disguised as justice-seeking.",
      "She Falsified Data in Her Previous Job: The 'disgrace' that cost her her analyst position wasn't incompetence—she manipulated findings to protect someone she cared about (possibly connected to her sister's disappearance). She tells herself it was necessary, but she knows it was a violation of everything she claims to believe in. She fears this moral compromise means she's not the good person she needs to believe she is, that she's capable of the same corruption as Voss if given sufficient motivation.",
      "She's Terrified She's Becoming Like Her Father: Implied backstory: her father was obsessive, controlling, unable to let go of perceived failures. He may have abandoned the family or been emotionally absent. Maya sees herself developing his patterns—the obsession, the inability to move forward, the need to control outcomes. She fears that her investigation isn't noble but rather a repetition of family pathology, that she's chasing ghosts the way he did, and that this obsession will cost her everything like it cost him."
    ],
    "emotional_baseline": "Controlled Exhaustion with Undercurrents of Desperation: Maya's default state is tightly managed intensity—focused, sharp, running on caffeine and adrenaline. She presents as competent and unflappable, but internally she's constantly vibrating with barely-suppressed anxiety. There's a brittleness to her composure; she can snap from controlled to explosive quickly if pushed. Beneath the surface runs a current of quiet desperation—the fear that she's running out of time, that answers are slipping away, that she's fundamentally failing. She oscillates between cold analytical detachment (where she can examine horror without flinching) and sudden moments of raw vulnerability where the weight of her sister's absence crashes through her defenses. These moments terrify her because they feel like loss of control. She masks them quickly with dark humor or tactical refocusing.",
    "triggers": [
      "Missing Persons Cases/Disappeared People: Anything involving someone vanishing triggers immediate emotional flooding—she projects her sister onto every victim. Her analytical mind becomes flooded with personal trauma, making her simultaneously more driven and more reckless. She overcommits to these cases, taking on unsustainable emotional burden. Positive spin: her empathy makes her exceptionally good at understanding victims' families.",
      "Dismissal or Disbelief of Her Theories: When someone—especially authority figures—refuses to take her analysis seriously or dismisses her connections as paranoia, it triggers rage disproportionate to the situation. This stems from being disbelieved about her sister's disappearance, from institutional failure. She becomes aggressive, proves her point through increasingly risky means, and burns bridges. This trigger makes her vulnerable to Kael if he validates her theories.",
      "Offers of Help She Didn't Ask For / Loss of Control: When someone tries to 'help' without being asked, or when circumstances force her to depend on others, she becomes defensive and hostile. It triggers her fear of powerlessness and her shame about needing anyone. She interprets assistance as judgment—that the other person sees her as incapable. This makes her difficult to work with despite her loyalty once trust is established.",
      "Silence and Uncertainty: Extended periods without leads or answers send Maya into psychological freefall. She needs information like others need oxygen. Silence triggers compulsive behavior—obsessive data review, reckless field work, inability to sleep. She'll take dangerous risks just to break the silence, to feel like she's making progress even if that progress is illusory.",
      "Symbols of Normalcy/People Moving On: When she encounters people living ordinary lives—families together, people not searching for the disappeared—she experiences sharp, unexpected grief and anger. It triggers her sense of unfairness, her fear that the world will move on and forget her sister. She sometimes sabotages her own relationships because witnessing others' peace feels like betrayal of her sister's memory.",
      "Compassion and Vulnerability in Others (Positive Trigger): When someone shows genuine emotion, admits fear, or demonstrates authentic vulnerability, Maya's defenses crack. She's drawn to people who are real—like Kael if he shows genuine uncertainty. This positive trigger makes her protective and loyal but also potentially blind to red flags, as she mistakes vulnerability for trustworthiness."
    ]
  },
  "backstory_motivation": {
    "timeline": [
      {
        "age": 6,
        "event": "Maya's parents enroll her in advanced mathematics and logic programs; Iris is born. Maya begins developing perfectionist tendencies and emotional distance as a coping mechanism for parental pressure and the arrival of a sibling who receives different (warmer) treatment."
      },
      {
        "age": 12,
        "event": "Maya discovers her parents' favoritism is systematic—they celebrate her academic achievements but dismiss Iris's creative pursuits. She begins using sarcasm as a defense mechanism and starts emotionally withdrawing, convincing herself that logic and independence are superior to emotional vulnerability."
      },
      {
        "age": 18,
        "event": "Maya enters DataVault Solutions as a junior analyst, driven by a need to prove her worth and escape her family dynamics. She excels rapidly, but begins to notice patterns in client data that shouldn't exist. Her obsessive nature kicks in—she can't let patterns go unsolved."
      },
      {
        "age": 22,
        "event": "Maya reports data irregularities to her supervisor, expecting institutional justice. Instead, she's terminated on fabricated charges. Her supervisor—who orchestrated her downfall—was covering up something much larger. Her parents blame her for the career failure. Iris is the only family member who believes in her. This event shatters her faith in systems and creates her core wound: betrayal by those in power, and the belief that loyalty is rare and precious."
      },
      {
        "age": 25,
        "event": "While working a gray-market data recovery job, Maya is violently attacked by a client who didn't appreciate her findings. The scar on her left cheekbone is a permanent reminder that knowledge without power is dangerous. She becomes more isolated, more obsessive about uncovering hidden truths, more convinced that trust is a liability."
      },
      {
        "age": 28,
        "event": "Iris disappears without explanation. Official reports claim voluntary relocation. Maya knows better. She begins an obsessive investigation into her sister's disappearance, using every skill and connection she's developed in the underground data world. She discovers traces of a larger conspiracy: Voss Industries and shadow organizations collecting disappeared people for illegal biotech experiments."
      },
      {
        "age": 30,
        "event": "Maya finds Iris's compass pendant in their old apartment—the only clue left behind. It becomes her talisman and obsession. She pivots fully into underground investigation work, burning bridges with legitimate clients, risking everything to follow the digital trail. She meets Kael, a mysterious figure who seems to know more than he should about Voss Industries and becomes her reluctant guide into deeper conspiracy."
      },
      {
        "age": 31,
        "event": "Present day. Maya is operating in the shadows, using her data analysis skills to uncover the architecture of Voss's operation. She's torn between her need to find Iris and her growing realization that dismantling Voss might require sacrificing her sister—or herself. She's beginning to trust Kael against her better judgment, which terrifies her."
      }
    ],
    "formative_experiences": [
      {
        "experience": "Parental Favoritism & Emotional Neglect (Age 6-18)",
        "impact": "Maya learned that intellectual achievement was the only reliable path to parental approval and love. Emotion was treated as weakness, intuition as unreliable. This created her core defense mechanism: sarcasm and emotional distance. She became obsessive about perfection and patterns because that's what was valued. The flip side: she developed a profound longing for genuine connection that she learned to bury. This manifests now as fierce loyalty to those she trusts (like Iris) combined with an inability to let people get close. Her sarcasm is both shield and weapon—it keeps people at arm's length while allowing her to process pain without appearing vulnerable."
      },
      {
        "experience": "Corporate Betrayal & Termination (Age 22)",
        "impact": "This event fractured Maya's faith in institutions, hierarchies, and the idea that 'doing the right thing' leads to justice. She reported corruption through proper channels and was destroyed for it. Her supervisor—someone she trusted—orchestrated her downfall with surgical precision. This taught her that systems protect their own, that power corrupts absolutely, and that loyalty to institutions is naive. She became obsessed with uncovering hidden patterns and corruption, driven by a need to prove she wasn't the corrupt one. But it also made her paranoid about being set up again, which drives her obsessive verification of details. She trusts data more than people because data can't lie—but it can be manipulated, which is why she obsesses over it."
      },
      {
        "experience": "Violent Betrayal & Physical Scarring (Age 25)",
        "impact": "A gray-market client attacked Maya when she uncovered information he didn't want exposed. The scar on her cheekbone is both literal and metaphorical: a permanent reminder that knowledge without power makes you a target. This experience crystallized her belief that vulnerability is dangerous and that she must be completely self-reliant. It also made her hypervigilant about reading people's intentions—she became obsessive about patterns in behavior, micro-expressions, inconsistencies. This hypervigilance is why she struggles so much with trusting Kael; she's constantly analyzing him for signs of betrayal. The scar itself became a barrier—a visual reminder to others (and herself) that she's dangerous, that she's been through something, that she's not to be trifled with."
      },
      {
        "experience": "Iris's Disappearance (Age 28-31)",
        "impact": "Iris was the one person Maya allowed herself to love unconditionally, the one crack in her armor. Her disappearance transformed Maya's obsession with uncovering patterns from a professional drive into an existential mission. It also activated her deepest fear: that her inability to trust and connect had caused her to miss warning signs, to fail to protect the person she loved. The compass pendant—Iris's compass, now useless—represents both her failure and her determination. It's a physical anchor to her guilt and her obsession. This experience pushed Maya from gray-market work into fully underground investigation, willing to burn everything to find answers. It also created a new internal conflict: she's driven by love (finding Iris) but operating from a place of trauma and isolation. She's becoming more like the systems she despises—willing to manipulate, deceive, and destroy in pursuit of her goal. This is the central tension that will drive her story."
      },
      {
        "experience": "Meeting Kael (Age 31, Present)",
        "impact": "Kael represents both salvation and threat. He seems to know things about Voss that took Maya months to uncover, which means either he's connected to the conspiracy or he's been investigating longer/deeper than her. This ambiguity is excruciating for someone with her trust issues. But he's also offering her something she desperately needs: partnership, guidance, someone who believes her. For the first time since Iris disappeared, Maya is considering letting someone in—and that terrifies her. Kael is forcing her to confront whether her obsessive independence is strength or self-sabotage, whether her patterns of isolation are protection or prison. His presence is creating cognitive dissonance: her survival instincts say 'trust no one,' but her human need for connection is whispering that maybe, just maybe, she doesn't have to do this alone."
      }
    ],
    "goals": {
      "surface": "Find her missing sister Iris and dismantle Voss Industries' operation. Uncover the conspiracy, expose those responsible, rescue the disappeared people being used in illegal experiments, and bring justice to the system that failed her.",
      "deep": "Prove that she's not broken, that she wasn't the corrupt one, that her instincts were right all along. Restore the connection with Iris that she fears she failed to protect. Reclaim agency in a world that has repeatedly shown her that she has none. Most fundamentally: find evidence that loyalty and love matter, that connection is possible, that she doesn't have to be alone—even though every experience has taught her the opposite."
    },
    "internal_conflicts": [
      {
        "conflict": "Independence vs. Connection",
        "description": "Maya has built her entire identity around self-reliance and emotional distance as survival mechanisms. But she's desperately lonely and terrified that isolation is slowly eroding her humanity. Meeting Kael forces this conflict to the surface: trusting him could be salvation or the final betrayal. Her sarcasm and walls protect her, but they also prevent her from getting help she genuinely needs. She's caught between the safety of isolation and the risk of connection."
      },
      {
        "conflict": "Justice vs. Revenge",
        "description": "Maya tells herself she wants justice—proper, institutional, fair. But her actions increasingly suggest she wants revenge. She's willing to manipulate, deceive, and destroy to find Iris and expose Voss. The line between righteous investigation and obsessive vendetta is blurring. She's becoming like the systems she despises—using people, bending rules, justifying it all as necessary. This conflict will force her to choose: can she maintain her moral center while operating in the shadows, or will the darkness consume her?"
      },
      {
        "conflict": "Obsession vs. Objectivity",
        "description": "Maya's obsessive attention to detail and pattern recognition are her greatest strengths, but they're also her vulnerability. With Iris missing, she's no longer objective—she sees connections that might not exist, interprets data through the lens of her desperation. She's aware of this flaw but can't seem to correct it. Kael might be helping her or using her obsession against her. She can't trust her own judgment anymore, which is devastating for someone who has always relied on logic as her anchor."
      },
      {
        "conflict": "Loyalty to Iris vs. Loyalty to Herself",
        "description": "Finding Iris might require Maya to sacrifice herself—to become the kind of person she despises, to make impossible ethical choices, to cross lines she swore she never would. She's beginning to suspect that Iris might not want to be found, or that finding her might mean discovering truths that destroy the idealized version of her sister she's been carrying. Maya must choose between the sister she loves and the person she's trying to become. Can she save Iris without losing herself in the process?"
      }
    ]
  },
  "voice_dialogue": {
    "speech_pattern": "Unknown",
    "verbal_tics": [
      "..."
    ],
    "vocabulary": "Unknown",
    "sample_dialogue": {
      "confident": "...",
      "vulnerable": "...",
      "stressed": "...",
      "sarcastic": "..."
    }
  },
  "physical_description": {
    "mannerisms": [
      "Obsessively manipulates her silver compass pendant—opening and closing the mechanism, running her thumb along its cardinal points, especially when processing information or under stress. The gesture is meditative but also ritualistic, a physical anchor that prevents her mind from untethering into pure pattern-recognition.",
      "Scans for exits upon entering any space—her eyes perform a rapid triangulation of doorways, windows, and potential escape routes before she fully engages with the environment. This happens automatically, below conscious awareness most of the time, but it's visible as a brief moment where her gaze 'maps' the room before settling.",
      "Tilts her head minutely when suspicious or encountering information that doesn't align with her patterns—a bird-like gesture that's almost imperceptible, but it signals her analytical mind is flagging an inconsistency. People who know her learn to recognize this as a sign she's caught something.",
      "Cracks her knuckles in a specific sequence (pinky to index on each hand) before confrontation or when about to voice a challenging theory—a ritualistic preparation that gives her a moment to steel herself and signals to observant people that she's about to push back.",
      "Positions her body at angles rather than directly facing people, especially authority figures or those she doesn't trust—a 45-degree orientation that allows her to maintain peripheral awareness of exits and other people in the space. It reads as casual but is actually strategic.",
      "Mirrors the breathing patterns of people she's trying to read or manipulate—unconsciously syncing her breath to theirs, a subtle empathetic response that contradicts her defensive exterior. This happens when she's genuinely engaged rather than in threat-assessment mode."
    ],
    "body_language": "Maya's default posture is paradoxical: her spine maintains rigid straightness (a holdover from perfectionist conditioning and the need to project competence), but her shoulders curve inward slightly, creating a subtle concave quality to her upper body. It's the posture of someone trying to be both immovable and unobtrusive simultaneously. Her arms typically remain close to her torso rather than open to the space around her—a closed posture that contradicts her intelligence and capability. Her hands are rarely still; when not fidgeting with her compass, her fingers move with restless precision: tapping patterns on surfaces, tracing the seams of her jacket, or forming shapes in the air as she thinks through problems. Her head is frequently tilted slightly downward, not in submission but in the posture of someone reviewing data on an internal screen. When she sits, she rarely settles fully into furniture; instead, she perches on the edge of chairs, her feet planted firmly on the ground, maintaining the physical readiness to move. Her face is typically composed into an expression of controlled neutrality—a professional mask that reveals nothing—but her eyes are in constant motion, tracking micro-expressions and environmental details. When stressed or triggered, her jaw tightens visibly, and she develops a habit of pressing her tongue against the roof of her mouth, creating a subtle tension across her face. In moments of genuine connection or when her defenses crack, her posture loosens almost imperceptibly; her shoulders drop, her head lifts, and she makes more direct eye contact, but this vulnerability is fleeting—she catches herself relaxing and re-tightens almost immediately, as if she's caught herself breaking protocol.",
    "movement_style": "Maya moves with controlled efficiency—no wasted motion, no flourishes. Her walk is quiet and measured, with a stride length that's slightly shorter than her height would suggest, giving her movement a contained quality. She doesn't stride; she glides, her footfalls deliberate and nearly silent, as if she's learned to move through the world without announcing her presence. Her pace varies with her mental state: when she's engaged in investigation or threat-assessment, she moves faster, with a subtle restlessness in her gait—her fingers twitch, her head swivels to track details, and she'll often stop abruptly when a thought strikes her. When she's processing difficult emotions or operating in stealth mode, she slows to an almost glacial pace, each movement economical and precise. Her gestures when speaking are minimal and close to her body—she doesn't use her hands expansively to illustrate points. Instead, her fingers make small, precise movements: pointing to specific details, forming shapes that represent data connections, or gripping her jacket when containing emotion. When she's animated or passionately explaining a theory, her hands rise slightly, her fingers spread in patterns that mirror network connections or data flows, but even then, the gestures remain within a relatively narrow radius around her torso. She has an unsettling habit of appearing in doorways or beside people without them noticing her approach—not through supernatural stealth, but through a combination of quiet movement and people's tendency to miss what they're not expecting to see. When confronted or threatened, her movement becomes even more controlled; she'll plant her feet in a grounded stance, her weight distributed evenly, her body angled to maintain peripheral awareness. There's a coiled quality to her stillness in these moments—not passive, but ready.",
    "physical_quirks": [
      "When deeply engaged in data analysis or problem-solving, Maya unconsciously traces patterns in the air with her index finger—drawing connections, mapping networks, writing equations—as if her hands are translating the data structures her mind is processing. She's often unaware she's doing this until someone points it out.",
      "She bites the inside of her cheek when processing information that contradicts her theories—a nervous habit that causes her to occasionally draw blood. It's a self-inflicted pain that seems to help her recalibrate her thinking, a physical way of forcing her mind to accept new data.",
      "Her left eye twitches slightly when she's lying or withholding information—a tell she's aware of but can't fully control. She compensates by keeping her left side angled away from people, or by touching her face near that eye as if scratching an itch, trying to mask the tell.",
      "She drums a specific rhythm on surfaces when impatient or waiting for information: three quick taps, a pause, two quick taps—a pattern that repeats. It's the rhythm of a data transmission pulse, unconsciously encoded into her physical nervous system.",
      "When someone shows genuine vulnerability or emotional authenticity around her, Maya's breathing becomes slightly shallow, and she'll unconsciously lean forward by mere inches—a physical response to her defenses cracking. She catches herself doing this and pulls back, creating a visible moment of self-correction that reads as rejection even when it's actually self-protection."
    ]
  },
  "story_arc": {
    "role": "Unknown",
    "arc_type": "Unknown",
    "transformation_beats": [
      {
        "act": 1,
        "beat": "Unknown"
      }
    ],
    "scene_presence": []
  },
  "relationships": {
    "relationships": [
      {
        "character": "Unknown",
        "type": "unknown",
        "dynamic": "Unknown",
        "evolution": "Unknown"
      }
    ]
  },
  "image_generation": null,
  "current_wave": 3,
  "current_checkpoint": 0,
  "agent_statuses": {
    "personality": {
      "status": "completed",
      "wave": 1
    },
    "backstory_motivation": {
      "status": "completed",
      "wave": 1
    },
    "voice_dialogue": {
      "status": "completed",
      "wave": 2
    },
    "physical_description": {
      "status": "completed",
      "wave": 2
    },
    "story_arc": {
      "status": "completed",
      "wave": 2
    },
    "relationships": {
      "status": "completed",
      "wave": 3
    },
    "image_generation": {
      "status": "pending",
      "wave": 3
    }
  }
}